Repository: bberkhin/YAMotion
Catalog: src/po/*/messages.po
Languages: ru

source: AXIS
ru: ОСИ

source: Error!
ru: Ошибка!

source: Warning!
ru: Предупреждение!

source: "%s" Not found
ru: "%s" Не найден

source: %c word given for arc in %s plane
ru: Параметр %c не должен быть определен для плоскости обработки %s

source: %c word missing in absolute center arc
ru: Не задан параметр %c определяющий центр дуги

source: %s Files (%s)|%s
ru: %s Файлы (%s)|%s

source: &About...
ru: О программе...

source: &Check updates
ru: Проверить обновления

source: &Copy Ctrl+C
ru: Копировать Ctrl+C

source: &Delete
ru: Удалить

source: &Delete Del
ru: Удалить Del

source: &Edit
ru: Правка

source: &File
ru: Файл

source: &Find Ctrl+F
ru: Найти Ctrl+F

source: &Help
ru: Помощь

source: &Indent increase Tab
ru: Увеличить отступ Tab

source: &Insert
ru: Вставить

source: &Lower case Ctrl+U
ru: Строчные

source: &New G-Code
ru: Новый G-Code файл

source: &Open
ru: Открыть

source: &Paste Ctrl+V
ru: Вставить Ctrl+V

source: &Quit Ctrl+Q
ru: Выход Ctrl+Q

source: &Redo Ctrl+Shift+Z
ru: Вернуть Ctrl+Shift+Z

source: &Rename
ru: Переименовать

source: &Replace Ctrl+H
ru: Заменить Ctrl+H

source: &Tools
ru: Инструменты

source: &Undo Ctrl+Z
ru: Отменить Ctrl+Z

source: &Upper case Ctrl+Shift+U
ru: Прописные Ctrl+Shift+U

source: 3D View:
ru: 3D Вид:

source: 3D view
ru: 3D вид

source: <untitled>
ru: <Безымянный>

source: About
ru: О программе

source: Action:
ru: Операция:

source: Add file path to pane
ru: Добавить путь на панель

source: Add folders
ru: Добавить каталоги

source: All Files|*.*
ru: Все файлы|*.*

source: All axes missing with G52 or G92
ru: Не указана ни одна ось для G52 или G92

source: All axes missing with motion code
ru: Не указана ни одна ось для кода перемещения

source: All macroses...
ru: Все макросы...

source: Angle (degree):
ru: Угол (градусы):

source: Arc move in concave corner cannot be reached by the tool without gouging
ru: Перемещение по дуги в вогнутом углу не может быть достигнуто инструментом без обработки

source: Arc radius too small to reach end point
ru: Радиус дуги слишком мал для достижения конечной точки

source: Arc to arc motion is invalid because the arcs have the same center
ru: Переход из дуги в дугу невозможен так как они имеют одинаковы центр

source: Arc to arc motion makes a corner the compensated tool can't fit in without gouging
ru: Перемещение от дуги к дуге создает угол который не может быть реализован в режиме компенсации инструмента

source: Arc to straight motion makes a corner the compensated tool can't fit in without gouging
ru: Перемещение от дуги к прямой создает угол который не может быть реализован в режиме компенсации инструмента

source: Argument to acos out of range
ru: Аргумент арккосинуса вне области определния

source: Argument to asin out of range
ru: Аргумент арксинуса вне области определния

source: Attempt to divide by zero
ru: Попытка деления на ноль

source: Attempt to raise negative to non integer power
ru: Попытка возвести отрицательное число в нецелую степень

source: Author
ru: Автор

source: Axis:
ru: Оси:

source: BACK
ru: СЗАДИ

source: BOTTOM
ru: СНИЗУ

source: BOX
ru: ГРАНИЦЫ

source: Bad format integer
ru: Неверный формат целого

source: Bad number format parsing '%s'
ru: Неверный формат числа при разборе '%s'

source: Calculation resulted is 'infinity'
ru: Результат расчета неопределен

source: Calculation resulted is 'not a number'
ru: Результат расчета не является числом

source: Can not find subroutinue: %s
ru: Подпрограмма %s не найдена

source: Can not insert G-Code to GCMC file!
ru: Невозможно вставить G-Code в GCMC файл!

source: Can not insert GCMC code to G-Code file!
ru: Невозможно вставить GCMC код в G-Code файл!

source: Can not open create file %s
ru: Ошибка создания файла %s

source: Can not open file %s
ru: Ошибка открытия файла %s

source: Can not open file %s in catalogs:
ru: Не могу найти\открыть файл %s в каталогах:

source: Can not open file %s!
ru: Ошибка открытия файла %s!

source: Can not open file: %s ...
ru: Ошибка открытия файла: %s ...

source: Can not remove %s
ru: Не могу удалить файл %s

source: Can not rename %s
ru: Ошибка перименования файла %s

source: Can not seek to position %ld of file
ru: Не могу переместиться на позицию %ld в файле

source: Can not write to the file %s
ru: Ошибка записи файла %s

source: Can't create the thread to run simulate
ru: Ошибка при создании потока для запуска симуляции

source: Cannot change axis offsets with cutter radius comp
ru: Невозможно изменить смещение оси при включенном режиме компенсации на радиус инструмента

source: Cannot change coordinate systems with cutter radius compensation on
ru: Невозможно изменить систему координат при включенном режиме компенсации на радиус инструмента

source: Cannot do zero repeats of cycle
ru: Невозможно сделать ноль повторов в циклк

source: Cannot feed with zero feed rate
ru: Невозможно задать скорость обработки равной 0

source: Cannot feed with zero spindle speed in feed per rev mode
ru: Невозможно задать скорость вращения шпинделя равной 0

source: Cannot turn cutter radius comp on when on
ru: Режиме компенсации на радиус инструмента уже включен

source: Cannot use G53 with cutter radius comp
ru: Нельзя использовать G53 при включенном режиме компенсации (на радиус) инструмента

source: Cannot use axis values with G80
ru: Нельзя задавать значения осей для G80

source: Cannot use axis values without a G code that uses them
ru: Нельзя задавать значения осей без установленного для них G кода

source: Cannot use canned cycles with cutter compensation on
ru: Нельзя использовать циклы сверления при включенном режиме компенсации (на радиус) инструмента

source: Cannot use two G codes that both use axis values
ru: Нельзя использовать два G кода каждый из которых использует значения осей

source: Center X:
ru: Центр X:

source: Center Y:
ru: Центр Y:

source: Center Z:
ru: Центр Z:

source: Change case to
ru: Изменить буквы на

source: Check
ru: Проверить

source: Check for Update
ru: Проверить обновления

source: Checking aborted
ru: Проверка отменена

source: Checking completed with %d error(s)
ru: Проверка завершена. %d ошибок

source: Checking completed with errors
ru: Проверка завершена с ошибками

source: Checking completed with no error
ru: Проверка завершена успешно

source: Checking for update
ru: Проверить обновления

source: Close
ru: Закрыть

source: Close abort
ru: Закрыть

source: Close all
ru: Закрыть все

source: Close all but this
ru: Закрыть все кроме этого

source: Command too long
ru: Очень длинная команда

source: Compensation type not left and no right
ru: Неустановлен тип компенсайии

source: Conflict M%d modal group
ru: Конфликт M%d модальных групп

source: Convert
ru: Конвертировать

source: Converting completed with errors
ru: Конвертация завершена с ошибками

source: Converting completed with no error
ru: Конвертация завершена успешно

source: Copy
ru: Копировать

source: Couldn't find/load the 'messages' catalog for locale '%s'.
ru: Не могу найти/загрузить 'messages' котолог для '%s' локали.

source: Create new file
ru: Создать новый файл

source: Create new window
ru: Открыть в новом окне

source: Cu&t Ctrl+X
ru: Вырезать Ctrl+X

source: Current point same as end point of arc
ru: Текущая точка дуги совпадает с конечной точкой

source: Cut
ru: Вырезать

source: Cutter compensation has generated an invalid arc with mismatched radiuses r1 %f r2 %f
ru: В режиме компенсации инструмента генерируются некорректные дуги с небьющимися радиусами r1 %f r2 %f

source: Cutter radius compensation allowed only in XY, XZ planes
ru: Режим компенсации на радиус инструмента возможен только для XY, XZ плоскостей обработки

source: Default preferences
ru: Настройки по умолчанию

source: Do you really want to remove file %s
ru: Вы действительно хотите удалить файл %s

source: Drawing aborted
ru: Отрисовка отменена

source: Drawing completed
ru: Отрисовка завершена

source: Dwell time P word missing with G82
ru: Для G82 не указано время остановки (параметр P)

source: ERROR
ru: ОШИБКА

source: Equal sign missing in parameter setting
ru: Отсутствует знак равенства в настройке параметров

source: Error %s pos: %d
ru: Ошибка %s позиция: %d

source: Error opening file
ru: Ошибка открытия файла

source: Error parsing file
ru: Ошибка анализа файла

source: Error parsing file %s
ru: Ошибка анализа файла %s

source: Error writing file
ru: Ошибка записи файла

source: Expected # reading parameter
ru: Ожидаем # при чтении параметра

source: Expected ] reading bracketed parameter
ru: Пропущена ]

source: Expression error
ru: Ошибка в выражении

source: FEEDBACK
ru: НАПИСАТЬ

source: FRONT
ru: СПЕРЕДИ

source: File %s is not a regular file of the file system Would you like to add it to folders pane?
ru: Файл %s не является простым файлом в файловой системе Вы действительно хотите добавить его в панель каталогов?

source: File %s is not saved! Save file before closing?
ru: Файл %s не сохранен! Сохранить файл перед закрытием?

source: File %s is very lage for the editor
ru: Файл %s очень большой для редактирования

source: File name not specified
ru: Не определено имя файла

source: Files
ru: Файлы

source: Fill parameters:
ru: Задайте параметры:

source: Find
ru: Найти

source: Find &next F3
ru: Найти следующий F3

source: Find and replace
ru: Найти и заменить

source: Find results
ru: Результаты поиска

source: Folders
ru: Каталоги

source: G code out of range
ru: Недопустимое значение G кода

source: G%d.1 with L word, but plane is not G18
ru: G%d.1 с L параметром, но плоскость обработки не G18

source: G%d.1 with no D word
ru: G%d.1 с незаданным параметром D

source: G-Code expression calculator
ru: Калькулятор выражений

source: G-Code reference
ru: Справочник G кодов

source: G-Code transformation
ru: G-Code калькулятор

source: G33 not supported
ru: G33 пока не поддерживается

source: G7 and G8 does not support yet
ru: G7 и G8 пока не поддерживается

source: G74 & G84 not supported yet
ru: G74 и G84 пока не поддерживается

source: G76 not supported
ru: G76 пока не поддерживается

source: G92.1 and G92.2 not implemented yet
ru: G92.1 и G92.2 пока не поддерживаются

source: G93 Inverse Time Mode not supported
ru: G93 (Inverse Time Mode) пока не поддерживается

source: G95 - is Units per Revolution Mode not supported
ru: G93 (Units per Revolution Mode) пока не поддерживается

source: GCMC documentation
ru: Документация по GCMC

source: GCMC is running very long time/ Would you like to kill the process?
ru: Конвертация GCMC работает уже очень долгоб возможно что-то пошло не так. Остановить процесс?

source: Help
ru: Помощь

source: Help me to make the app better
ru: Критика и пожелания приветсвуются

source: Hide folders pane Ctrl+P
ru: Скрыть панель каталогов Ctrl+P

source: Home page
ru: Домашняя страница

source: I&ndent reduce Shift+Tab
ru: Уменьшить отступ Shift+Tab

source: ISOMETRIC
ru: ИЗОМЕТРИЯ

source: In selected
ru: В выделенном

source: Incorrect feed value
ru: Недопустимое значение скорости обработки

source: Insert
ru: Вставить

source: Insert as GCMC
ru: Вставить как GCMC код

source: Invalid plane for cutter compensation
ru: Неверная плоскость обработки для режима компансации инструмента

source: Invalid tool id used
ru: Неверный номер инструмента

source: LEFT
ru: СЛЕВА

source: Language ...
ru: Язык...

source: Languages
ru: Языки

source: Left bracket missing after slash with atan
ru: Пропущена '[' после '/' для функции atan

source: Left bracket missing after unary operation name
ru: Пропущена '[' после имени функции

source: Length of cutter compensation entry move is not greater than the tool radius
ru: Перемещение в режиме компенсации инструмента меньше чем радиус инструмента

source: Letter $ - multishpindle not supported
ru: Символ $ (поддержка нескольких шпинделей) пока не поддерживается

source: Licence type
ru: Тип лицензии

source: Line %d:
ru: Строка %d:

source: Line %d: Error feedrate value %g
ru: Строка %d: Недопустимое значение скорости обработки %g

source: M code greater than 199: M%d
ru: M код больше чем 199: M%d

source: Macroses List
ru: Макросы

source: Matilda website
ru: Matilda вебсайт

source: Max value:
ru: Максимальное значение:

source: Min value:
ru: Минимальное значение:

source: Mixed radius IJK format for arc
ru: Одновременное использование IJK формата и R (радиуса) для дуг

source: More than %d errors. Executing is stopped!
ru: Больше чем %d ошибок. Проверка остановлена!

source: More then 100 outputs
ru: Больше 100 сообщений

source: Multiply word %c is defened
ru: Множественно использование параметра %c

source: Named parameter does not support yet
ru: Именованные параметры пока не поддерживаются

source: Negative D word tool radius index used
ru: Отрицательное значение параметра D для задание радиуса инструмента

source: Negative G code used
ru: G кода не может быть отрицательным

source: Negative M code used
ru: M код не может быть отрицательным

source: Negative or zero Q value used
ru: Q параметр не может быть отрицательным или равным нулю

source: New G-Code
ru: Новый G-Code файл

source: New G-Code Ctrl+N
ru: Новый G-Code файл Ctrl+N

source: New GCMC
ru: Новый GCMC файл

source: New GCMC Ctrl+Shift+N
ru: Новый GCMC Ctrl+Shift+N

source: No characters found in reading real value
ru: Не задано действительное число

source: No description
ru: Нет описания

source: Non integer value for integer
ru: Не целое значение хотя ожидается целое

source: Open
ru: Открыть

source: Open .. Ctrl+O
ru: Открыть... Ctrl+O

source: Open download page...
ru: Открыть страницу загрузки...

source: Open file
ru: Открыть файл

source: Open file...
ru: Открыть файл...

source: Open file: "%s"
ru: Открыть файл: %s

source: Open folder
ru: Открыть папку

source: Open recent
ru: Открыть недавние

source: Output
ru: Вывод

source: P word missing with M98
ru: Не задан параметр P для M98

source: Parameter is readonly
ru: Parameter только для чтения

source: Parameter number out of range
ru: Номер параметра вне допустимых пределов

source: Parameters:
ru: Параметры:

source: Parsing cancelled
ru: Проверка отменена

source: Paste
ru: Вставить

source: Path:
ru: Путь:

source: Plane:
ru: Плоскость:

source: Please, select at least one parameter
ru: Выберите хотя бы один параметр

source: Preferences
ru: Настройки

source: Properties changed
ru: Настройки изменены

source: Q word missing with G83
ru: Не задан параметр Q для G83

source: Q word missing with g73
ru: Не задан параметр Q для G73

source: R I J K words all missing for arc
ru: Не один из параметров R I J K не задан для дуги

source: R less than X in cycle in YZ plane
ru: R меньше чем X для окружности в плоскости YZ

source: R less than Y in cycle in XZ plane
ru: R меньше чем Y для окружности в плоскости XZ

source: R less than Z in cycle in XY plane
ru: R меньше чем Z для окружности в плоскости XY

source: RIGHT
ru: СПРАВА

source: Radius of cutter compensation entry arc is not greater than the tool radius
ru: Радиус инструмента больше или равен радиусу дуги в режиме компенсации

source: Radius to end of arc differs from radius to start: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f abs_err=%.4g rel_err=%.4f%%
ru: Радиус конечной точки дуги не равен радиусу начальной точки дуги: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f abs_err=%.4g rel_err=%.4f%%

source: Read error on file '%s'
ru: Ошибка чтения файла %s

source: Recent Files
ru: Последние файлы

source: Remove folder from pane
ru: Убрать папку из панели

source: Removing file(s)
ru: Удаление файла(ов)

source: Rename
ru: Переименовать

source: Renaming file
ru: Переименование файла

source: Replace &again Shift+F4
ru: Заменить снова Shift+F4

source: Rotate
ru: Вращение

source: Rotate...
ru: Вращение...

source: Save Ctrl+S
ru: Сохранить Ctrl+S

source: Save %s
ru: Сохранить %s

source: Save as... Ctrl+Shift+S
ru: Срохранить как... Ctrl+Shift+S

source: Save file
ru: Сохранение файла

source: Save file as
ru: Сохранить файл как

source: Select directory
ru: Выберите каталог

source: Select language:
ru: Выберите язык:

source: Select the macros:
ru: Выберите макрос:

source: Show folders pane Ctrl+P
ru: Показать панель каталогов Ctrl+P

source: Slash missing after first atan argument
ru: Пропущена '/' после первого аргумента функции atan

source: Speed: x%d
ru: Скорость: x%d

source: Spindle speed is incorrect
ru: Не допустимая скорость шпинделя

source: Start checking & drawing: %s
ru: Запущена проверка & отрисовка: %s

source: Start checking...
ru: Запущена проверка...

source: Start checking: %s
ru: Запущена проверка: %s

source: Start converting...
ru: Запущена конверация...

source: Start transforming: %d lines...
ru: Расчет запущен: Строка %d ...

source: Stop
ru: Остановить

source: Straight feed in concave corner cannot be reached by the tool without gouging
ru: Прямая подача в вогнутом углу не может быть достигнута инструментом

source: Straight traverse in concave corner cannot be reached by the tool without gouging
ru: Прямое перемещение в вогнутом углу не может быть достигнута инструментом

source: Subritine name does not supported
ru: Имена подпрограмм не поддерживаются

source: TOP
ru: СВЕРХУ

source: Text could not be saved!
ru: Текст не может быть сохранен!

source: The changes you did, will applay after restarting the program. Would you like to restart?
ru: Изменения вступят в силу после перезапуска программы. Перезапустить?

source: Themes
ru: Темы

source: There are %d error(s).
ru: Найдено %d ошибок.

source: This language is not supported by the system.
ru: Язык не поддерживается системой.

source: Too many parameters for dwell G4
ru: Слишком много параметров для команды G4 (пауза выполнения программы)

source: Tool radius must be less than arc radius with comp
ru: Радиус инструмента больше или равен радиусу дуги в режиме компенсации

source: Transform...
ru: Преобразовать...

source: Transforming aborted
ru: Расчет отменен

source: Transforming completed.
ru: Расчет завершен.

source: Traverce:
ru: Холостой ход:

source: Two G codes used from same modal group: G%d and G%d
ru: Несовместимые G-коды (G%d и G%d) в одном фрэйме исполнения

source: Unclosed expression
ru: Незаконченное выражение

source: Undo
ru: Отменить

source: Unknown G code used: G%d
ru: Неизвестный G-код: G%d

source: Unknown operation
ru: Неизвестная функция

source: Unknown operation name starting with %c
ru: Неизвестная функция, начинающаяся с символа %c

source: Unknown word starting with %c
ru: Неизвестное слово, начинающееся с символа %c

source: Unknown word where unary operation could be
ru: Неизвестное слово вместо унарной функции

source: Unsupported plane in cutter compensation
ru: Текущяя плоскость обратботки не поддерживается в режиме коррекция на режущий инструмента

source: Uups some erorr
ru: Уппс, что-то пошло не так

source: Uups there is no any selection
ru: Уппс, в тексе нет выделения

source: Value:
ru: Значение:

source: Version avalible: %s (Current: %s)
ru: Доступная версия: %s (Текущая: %s)

source: Version: %s
ru: Версия: %s

source: Welcome
ru: Начальная страница

source: Welcome screen
ru: Начальная страница

source: Welcome window Ctrl+W
ru: Начальная страница Ctrl+W

source: Word 'D' must be defined for G96 (CSS mode)
ru: Для G96 (CSS) должен быть определен параметр 'D'

source: Word 'H' must be defined for G43 and G44
ru: Для G43 и G44 должен быть определен параметр 'H'

source: Word 'L' must be defined for G10
ru: Для G10 должен быть определен параметр 'L'

source: Word 'P' is out of range
ru: Недопустимое значение параметра 'P'

source: Word 'P' must be defined for G10
ru: Для G10 должен быть определен параметр 'P'

source: Word 'S' must be defined for G96 (CSS mode)
ru: Для G96 (CSS) должен быть определен параметр 'S'

source: Would you like to remove file %s from history list?
ru: Удалить файл %s из списка последних открытых файлов?

source: Wrong N value
ru: Неправильное значение N

source: Wrong letter: %c
ru: Неизвестный символ: %c

source: X and Y words missing for arc in XY plane
ru: Не заданы значения X and Y для дуги на плоскости XY

source: X and Z words missing for arc in XZ plane
ru: Не заданы значения X and Z для дуги на плоскости XZ

source: X value unspecified in YZ plane canned cycle
ru: Не задано значение X на плоскости YZ для цикла сверления

source: Y and Z words missing for arc in YZ plane
ru: Не заданы значения Y и Z для дуги на плоскости YZ

source: Y value unspecified in XZ plane canned cycle
ru: Не задано значение Y на плоскости XZ для цикла сверления

source: You have the latest version of the application
ru: У вас установленна последняя версия программы

source: Z value unspecified in XY plane canned cycle
ru: Не задано значение Z на плоскости XY для цикла сверления

source: Zero degree inside corner is invalid for cutter compensation
ru: Не допустимое ( равное нулю) значение внутреннего угла в ражиме компенсации инструмента

source: Zero or negative argument to ln
ru: Аргумент логарифма меньше или равен нулю

source: Zero-radius arc: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f
ru: Дуга с нулевым радиусом: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f

source: [G85;G88] not supported yet
ru: [G85;G88] пока не поддерживаются

source: gcmc_vc.exe already running
ru: gcmc_vc.exe уже запущена

source: unknown
ru: неизвестный язык

source: unnamed%d.%s
ru: безымянный%d.%s

source: unnamed.%s
ru: безымянный.%s
